{"2015-09-08T04:47:35 02:00":{"content":"<h1>out with the old</h1>\r\n\r\n<p><a href=\"http://www.sunovacu.ca/ProductsServices#personal-banking-access-phone\">Sunova by Phone</a>&nbsp;is going the way of the Dodo bird! This service will be discontinued as of January 1, 2017.</p>\r\n\r\n<p>But never fear: we have even more convenient account access options, including Sunova GO Online, SMS banking, and soon, Sunova GO Mobile! By doing away with Sunova by Phone, we can focus on these awesome new technologies and services, and we think you&#39;ll love the results.</p>\r\n\r\n<p>Have questions? We&#39;d love to hear them &ndash;&nbsp;<a href=\"http://www.sunovacu.ca/Contact\">send us an email</a>or give your&nbsp;<a href=\"https://www.sunovacu.ca/%E2%80%9D\">local branch</a>&nbsp;a call!</p>\r\n","fromdate":"2015-09-08","id":42},"2015-09-08T04:48:12 02:00":{"content":"<h1>construction mortgages are our specialty!</h1>\r\n\r\n<p>build something beautiful with Sunova!</p>\r\n\r\n<p>Building your dream home is exciting, but it isn&rsquo;t always easy. At Sunova we have a group of expert lenders who specialize in construction mortgages and can help you navigate the confusion! Stop by and find out how we can help you build you dream home (invitations to housewarming parties optional &ndash; but we make a mean spinach dip!).</p>\r\n\r\n<p><br />\r\n<br />\r\n<a href=\"https://www.sunovacu.ca/News#\" onclick=\"showDialog('/News/NewsImage?itemID=151', {title:'', modal:true, width:'1032px', draggable:false}); return false;\"><img alt=\"\" src=\"https://www.sunovacu.ca/Resources/images/newsItems/article_151.jpg\" /></a></p>\r\n","fromdate":"2015-09-08","id":42},"2015-09-08T04:48:40 02:00":{"content":"<h1>our electronic services agreement is changing!</h1>\r\n\r\n<p>As of October 1, Sunova&rsquo;s Electronic Services Agreement is changing. Why the change? Because at Sunova, we&rsquo;re always working hard to offer our members services that are brighter, brainier, and just plain better!</p>\r\n\r\n<p>We&rsquo;ve developed an awesome mobile app that we think is going to make your banking experience with us more convenient than ever. Plus, soon you&rsquo;ll be able to remotely deposit cheques with your phone! But with awesome stuff comes less-awesome paperwork, and we had to update our electronic services agreement to include these changes.</p>\r\n\r\n<p>You will be prompted to accept the new agreement when you change your Sunova Online password after October 1. Curious about the details? Click&nbsp;<a href=\"http://www.sunovacu.ca/content/files/SunovaElectronicServicesAgreement.pdf\">here</a>&nbsp;to view the agreement now.</p>\r\n","fromdate":"2015-09-08","id":42}}